IDEA StatiCa Open Model
RigidLink.MasterNode Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Node to which all six independent degrees of freedom for the element are assigned
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement MasterNode { get; set; }
Public Property MasterNode As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ MasterNode {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace